Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АбонементПакетУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АбонементЧленство</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Посещение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Посещение</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаПрихода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаУхода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаВъездаНаПарковку</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаВыездаСПарковки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПосещениеЗакрыто</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/МенеджерОборудованияСКУД_КОРП/Ext/Module.bsl
&Вместо("ПолучитьДоступ")
Функция PocketKey_ПолучитьДоступ(Клиент, Карта, ДатаПрохода, Вход, СтруктурнаяЕдиница, МассивПомещений, АктивироватьЧПУ, НеСоздаватьНовоеПосещение, ТребуетсяМедСправка, РегистироватьПроход ,ВыборОснованияПрохода)
	
	СтруктураВозврат = Новый Структура("Доступ, Основание, Гость, Описание", Ложь, , Ложь, "");

	Если ТипЗнч(МассивПомещений) = Тип("Массив") и МассивПомещений.Количество() = 0 Тогда
		МассивПомещений = Неопределено;
	КонецЕсли;	

	// Заперед на проход без QR-кодов COVID-19
	Если РегистироватьПроход = Истина И СтруктурнаяЕдиница.ОграничениеПроходовПоQR 
		И Не РегистрыСведений.МедицинскиеСправкиКлиентов.НаличиеУКлиентаСправкиCOVID(Клиент, ДатаПрохода) Тогда		
		СтруктураВозврат.Описание  = "нет действующей мед. справки COVID-19";		
		Возврат СтруктураВозврат;                                   		
	КонецЕсли;

	// Если клиент входит или выходит по ключу, то доступ дается по открытому посещению.
	// как на вход так и на выход. 	
	Если ТипЗнч(Карта) = Тип("СправочникСсылка.Ключи") Тогда
		Посещение = ПолучитьПосещение(СтруктурнаяЕдиница, Клиент, ДатаПрохода, Карта, Истина);
		Если Не Посещение = Неопределено Тогда 

			// Если основание это членство или пакет услуг, то необходимо выполнить проверку на доступ к помещениям.
			Если ТипЗнч(Посещение.Основание) = Тип("ДокументСсылка.ЧленствоПакетУслуг") Тогда				

				// Проверка на доступ к помещениям
				Если Посещение.Основание.Номенклатура.ЧленствоПакетУслугОграничениеПоПомещениям = Перечисления.ТипыОграниченийЧленствПакетовУслуг.ДоступОграниченПомещениями
					и Не МассивПомещений = Неопределено Тогда
					ЕстьДоступВПомещение = Ложь;
					Для Каждого СтрокаДоступа из Посещение.Основание.Номенклатура.ЧленствоПакетУслугДоступКПомещениям Цикл
						Если НЕ МассивПомещений.Найти(СтрокаДоступа.Помещение) = Неопределено Тогда
							ЕстьДоступВПомещение = Истина;
							Прервать;
						КонецЕсли;				
					КонецЦикла;	
				Иначе
					ЕстьДоступВПомещение = Истина;
				КонецЕсли;

				Если ЕстьДоступВПомещение Тогда	
					// Если основание Пакет услуг ограниченный кол-м посещений и веременем (мин.)
					// то необходимо расчитывать чистое время прибывания в клубе клиента на входе.
					Если Посещение.ВремяПосещенияНеБолее > 0 Тогда
						СтруктураВозврат.Доступ = ПолучитьДоступПоВременномуЧленствуПакетуУслуг(Вход, Карта, Посещение.ДатаПрихода, Посещение.Основание);
					Иначе
						СтруктураВозврат.Доступ = Истина;
					КонецЕсли;
				Иначе
					СтруктураВозврат.Доступ = Ложь;
				КонецЕсли;
				СтруктураВозврат.Гость     = Посещение.ПризнакГость;
				СтруктураВозврат.Основание = Посещение.Основание;			 
				Возврат СтруктураВозврат;				

			ИначеЕсли МассивПомещений = Неопределено Тогда
				СтруктураВозврат.Доступ = Истина;	
				СтруктураВозврат.Гость     = Посещение.ПризнакГость;
				СтруктураВозврат.Основание = Посещение.Основание;			 
				Возврат СтруктураВозврат;				

			КонецЕсли;			                                        			
		Иначе
			Возврат СтруктураВозврат;
		КонецЕсли;		
	КонецЕсли;

	ТекущаяДата            = НачалоДня(ДатаПрохода);
	ТекущееВремя           = Дата(1,1,1,Час(ДатаПрохода),Минута(ДатаПрохода),00);
	ДеньНедели             = ДеньНедели(ТекущаяДата);
	ЭтоПраздничныйДень     = ОбщегоНазначения.ЭтоПраздничныйДень(ТекущаяДата);
	ЭтоРабочийДень 	   	   = ОбщегоНазначения.ЭтоРабочийДень(ТекущаяДата);
	ВремяПереодеванияДо    = Константы.ВремяПереодеванияДоЗанятия.Получить() * 60;
	ВремяПереодеванияПосле = Константы.ВремяПереодеванияПослеЗанятия.Получить() * 60;

	МассивВремениРаботы = ВремяРаботыСтруктурнойЕдиницы(СтруктурнаяЕдиница, ДеньНедели, ДатаПрохода, ЭтоПраздничныйДень);

	Если Не ЗначениеЗаполнено(МассивВремениРаботы)
		ИЛИ РегистрыСведений.БронированиеПосещений.НеобходимоНаличиеБрони(ДатаПрохода, Клиент, СтруктурнаяЕдиница) Тогда
		Возврат СтруктураВозврат;
	КонецЕсли;

	// Если требуется мед. справка проверяем ее. 	
	МедСправкаДействительна = Ложь;

	Если ТребуетсяМедСправка Тогда

		МедСправкаКлиента = РегистрыСведений.МедицинскиеСправкиКлиентов.ПолучитьМедицинскуюСправкуКонтрагента(Клиент,, ДатаПрохода);						

		Если ЗначениеЗаполнено(МедСправкаКлиента) Тогда			
			ДатаОкончанияСправки = ?(ЗначениеЗаполнено(МедСправкаКлиента.ДатаОкончания), МедСправкаКлиента.ДатаОкончания, ДобавитьМесяц(МедСправкаКлиента.ДатаВыдачи, МедСправкаКлиента.МедСправка.СрокДействия));			
			Если НачалоДня(ДатаОкончанияСправки + МедСправкаКлиента.МедСправка.БлокироватьВходЧерез * 86400) >= НачалоДня(ДатаПрохода) Тогда
				МедСправкаДействительна = Истина;
			КонецЕсли;									
		КонецЕсли;
	КонецЕсли;  

	ТаблицаДоступов = СоздатьТаблицуДоступов();
	
	#Область ЛАА_ТридцатьМинутПослеЗакрытияКлуба_Добавлено
	
	// Задача - https://intranet.terfit.ru/company/personal/user/1556/tasks/task/view/116621/
	// Временно закомментировал, так как со штрафами возможно эта система и не нужна будет
	
	//Если НЕ Вход Тогда
	//
	//	НовыйДеньНедели = ДеньНедели(ТекущаяДата);
	//	
	//	Если (НовыйДеньНедели = 6 И Час(ТекущаяДата) > 1) ИЛИ НовыйДеньНедели = 7 ИЛИ ЭтоПраздничныйДень Тогда
	//		НовоеВремяНачало = НачалоДня(ТекущаяДата) + 60*60*23;
	//		НовоеВремяКонец = НачалоДня(ТекущаяДата) + 60*60*23 + 60*30;
	//	Иначе
	//		НовоеВремяНачало = НачалоДня(ТекущаяДата);
	//		НовоеВремяКонец = НачалоДня(ТекущаяДата) + 60*30;
	//	КонецЕсли;	
	//						
	//	НоваяСтруктура	= Новый Структура("ЧленствоПакетУслуг, ВремяНачало, ВремяКонца, Приоритет, ТребуетсяМедСправка", NULL, НовоеВремяНачало, НовоеВремяКонец, 999, Ложь);
	//	НоваяСтрока		= ТаблицаДоступов.Добавить();
	//	ЗаполнитьЗначенияСвойств(НоваяСтрока, НоваяСтруктура);
	
	//КонецЕсли;	
	
	#КонецОбласти

	// 1. Членства и пакеты посещений 
	
	// ++ LZRV
	ВремяПереодеванияДо    = 0;
	ВремяПереодеванияПосле = 0;
	// -- LZRV
	
	ТаблицаЧленств = PocketKey_Модуль.PocketKey_ПолучитьТаблицуЧленств(СтруктурнаяЕдиница, Клиент, ДатаПрохода);
	Для Каждого СтрокаЧленство из ТаблицаЧленств Цикл

		МассивДоступа = Новый Массив;

		// Проверка на просрочку по рассрочкам.
		Если ТипЗнч(СтрокаЧленство.ДокументПродажи) = Тип("ДокументСсылка.Реализация") И СтрокаЧленство.ОплачиваетсяВРассрочку = Истина
			И ПросрочкаОплатыПоРассрочке(СтрокаЧленство.ДокументПродажи, СтрокаЧленство.ШаблонРассрочки, СтрокаЧленство.СуммаПродажи) Тогда

			// Добавим это ЧПУ в таблицу доступа, чтобы вывести сообщение в журнал о причине отказа прохода.			
			НоваяСтрока = ТаблицаДоступов.Добавить();
			НоваяСтрока.ЧленствоПакетУслуг = СтрокаЧленство.ЧленствоПакетУслуг;
			НоваяСтрока.ВремяНачало        = ДатаПрохода;  // тут нам не важны реальные интервалы вермени доступа
			НоваяСтрока.ВремяКонца         = ДатаПрохода;
			НоваяСтрока.Просрочка          = Истина;

			// Дальнейшие проверки не выполняем, просрочена оплата ЧПУ.
			Продолжить;
		КонецЕсли;		

		// Если членство или пакет услуг ограничено посещениями.
		// При последнем посещение после входа остаток будет 0, но мы должны впускать и выпускать клиента по зонам.
		Если СтрокаЧленство.Остаток = 0 Тогда

			ОткрытоеПосещение = НеСоздаватьНовоеПосещение = 0;			
			Посещение = ПолучитьПосещение(СтруктурнаяЕдиница, Клиент, ДатаПрохода,, ОткрытоеПосещение);

			Если НеСоздаватьНовоеПосещение > 0 И НЕ Посещение = Неопределено
				И Посещение.ПосещениеЗакрыто И Посещение.ДатаУхода <= ДатаПрохода - (НеСоздаватьНовоеПосещение * 60) Тогда
				Посещение = Неопределено;
			КонецЕсли;

			// Если посещение уже закрыто, то не даем доступ клиенту.
			Если Посещение = Неопределено Тогда
				Продолжить;
			КонецЕсли;

			// Если клиент хочет войти в клуб и у него нет остатка, не пускаем его
			Если СтрокаЧленство.Остаток = 0 И РегистироватьПроход И Вход Тогда
				Продолжить;
			КонецЕсли;

		КонецЕсли;

		// Проверка на доступ к помещениям
		Если СтрокаЧленство.ОграничениеПоПомещениям = Перечисления.ТипыОграниченийЧленствПакетовУслуг.ДоступОграниченПомещениями
			и Не МассивПомещений = Неопределено Тогда
			ЕстьДоступВПомещение = Ложь;
			Для Каждого СтрокаДоступа из СтрокаЧленство.ДоступКПомещениям Цикл
				Если НЕ МассивПомещений.Найти(СтрокаДоступа.ОснованиеПомещение) = Неопределено Тогда
					ЕстьДоступВПомещение = Истина;
					Прервать;
				КонецЕсли;				
			КонецЦикла;
			// Если нет доступа в помещение, то дальнейшие проверки не выполняем.
			Если Не ЕстьДоступВПомещение Тогда
				Продолжить;
			КонецЕсли;			
		КонецЕсли;
		
		Если СтрокаЧленство.ОграниченияПоВремениДействияИзменены ИЛИ СтрокаЧленство.ВремяДействия.Количество() > 0 Тогда
			ОграничениеПоВремениДействия = СтрокаЧленство.ОграничениеПоВремениДействия;
			ТаблицаВремяДействия 		 = СтрокаЧленство.ВремяДействия;
		Иначе
			ОграничениеПоВремениДействия = СтрокаЧленство.НоменклатураОграничениеПоВремениДействия;
			ТаблицаВремяДействия 		 = СтрокаЧленство.НоменклатураВремяДействия;
		КонецЕсли;

		Если ОграничениеПоВремениДействия = Перечисления.ТипыОграниченийЧленствПакетовУслуг.ВремяОграничено Тогда
			Для каждого СтрокаТЧ Из ТаблицаВремяДействия Цикл

				Если ПроверкаОграниченияПоДнямНедели(СтрокаТЧ.ДеньНедели, ТекущаяДата, ЭтоРабочийДень) Тогда

					// Если Время начало больше времени конца, значит время конца другой день.
					// 01.01.0001 09:00 и 01.01.0001 02:00 и надо перекинуть на другой день.
					ВремяПо = ?(СтрокаТЧ.ВремяС > СтрокаТЧ.ВремяПо, СтрокаТЧ.ВремяПо + 86400, СтрокаТЧ.ВремяПо);

					// Проверяем предыдущий день, в том случае если стуктурка работает после 24 часов.
					Если МассивВремениРаботы.Количество() > 1 Тогда
						ПредыдущийДеньРабочий = ОбщегоНазначения.ЭтоРабочийДень(ТекущаяДата - 1);
						Если ПроверкаОграниченияПоДнямНедели(СтрокаТЧ.ДеньНедели, ТекущаяДата - 1, ПредыдущийДеньРабочий) И День(ВремяПо) = 2 Тогда

							// Если время окончания работы клуба меньше чем указано в членстве, проводим корректировку.
							Если МассивВремениРаботы[0].ОкончаниеРаботы > (Дата(1,1,1) + Час(СтрокаТЧ.ВремяПо) * 3600 + Минута(СтрокаТЧ.ВремяПо) * 60) Тогда
								ВремяКонца  = (ТекущаяДата + Час(СтрокаТЧ.ВремяПо) * 3600 + Минута(СтрокаТЧ.ВремяПо) * 60) + ВремяПереодеванияПосле; 			
							Иначе
								ВремяКонца  = (ТекущаяДата + Час(МассивВремениРаботы[0].ОкончаниеРаботы) * 3600 + Минута(МассивВремениРаботы[0].ОкончаниеРаботы) * 60) + ВремяПереодеванияПосле;
							КонецЕсли;

							МассивДоступа.Добавить(Новый Структура("ЧленствоПакетУслуг, ВремяНачало, ВремяКонца, Приоритет, ТребуетсяМедСправка",
							СтрокаЧленство.ЧленствоПакетУслуг, ТекущаяДата, ВремяКонца, СтрокаЧленство.Приоритет, СтрокаЧленство.ТребуетсяМедСправка));							
						КонецЕсли;
					Иначе
						// Проверим на время окончания работы клуба.
						Если НЕ МассивВремениРаботы[0].ОкончаниеРаботы = Дата(1,1,1, 23,59,59)
							И МассивВремениРаботы[0].ОкончаниеРаботы < ВремяПо Тогда
							ВремяПо = МассивВремениРаботы[0].ОкончаниеРаботы;							
						КонецЕсли;		

					КонецЕсли;

					// Проверим на время начала работы клуба.
					Если МассивВремениРаботы[0].НачалоРаботы > СтрокаТЧ.ВремяС Тогда
						ВремяС = МассивВремениРаботы[0].НачалоРаботы;
						ВремяНачало = (ТекущаяДата + Час(ВремяС) * 3600 + Минута(ВремяС) * 60)
					Иначе
						ВремяНачало = (ТекущаяДата + Час(СтрокаТЧ.ВремяС) * 3600 + Минута(СтрокаТЧ.ВремяС) * 60) - ВремяПереодеванияДо;
					КонецЕсли; 								

					Если День(ВремяПо) = 2 Тогда                                                                                           						 
						ВремяКонца = КонецДня(ТекущаяДата);
					Иначе
						ВремяКонца = (ТекущаяДата + Час(СтрокаТЧ.ВремяПо) * 3600 + Минута(СтрокаТЧ.ВремяПо) * 60) + ВремяПереодеванияПосле;						
					КонецЕсли;
					
					//++ЛазаревАА (Добавлена проверка на время работы клуба)
					// Проверим на время начала работы клуба.
					ВремяНачалоРаботы = МассивВремениРаботы[0].НачалоРаботы;
					Если Час(ВремяНачалоРаботы) > Час(ВремяНачало) Тогда
						ВремяНачало = (ТекущаяДата + Час(ВремяНачалоРаботы) * 3600 + Минута(ВремяНачалоРаботы) * 60)
					КонецЕсли; 
					//--ЛазаревАА (Добавлена проверка на время работы клуба)

					МассивДоступа.Добавить(Новый Структура("ЧленствоПакетУслуг, ВремяНачало, ВремяКонца, Приоритет, ТребуетсяМедСправка",
					СтрокаЧленство.ЧленствоПакетУслуг, ВремяНачало, ВремяКонца, СтрокаЧленство.Приоритет, СтрокаЧленство.ТребуетсяМедСправка));

				КонецЕсли; 
			КонецЦикла;
		Иначе 			
			Для Каждого СтрокаМ Из МассивВремениРаботы Цикл
				ВремяНачалоЧленство = НачалоДня(ТекущаяДата) + Час(СтрокаМ.НачалоРаботы)    * 3600 + Минута(СтрокаМ.НачалоРаботы)    * 60; 
				ВремяКонцаЧленство  = НачалоДня(ТекущаяДата) + Час(СтрокаМ.ОкончаниеРаботы) * 3600 + Минута(СтрокаМ.ОкончаниеРаботы) * 60;	
				МассивДоступа.Добавить(Новый Структура("ЧленствоПакетУслуг, ВремяНачало, ВремяКонца, Приоритет, ТребуетсяМедСправка",
				СтрокаЧленство.ЧленствоПакетУслуг, ВремяНачалоЧленство, ВремяКонцаЧленство, СтрокаЧленство.Приоритет, СтрокаЧленство.ТребуетсяМедСправка));			
			КонецЦикла;
		КонецЕсли;

		// Проверим на пакет посещений ограниченный временем
		Если ЗначениеЗаполнено(СтрокаЧленство.ВремяПосещенияНеБолее) И Вход Тогда
			// Определим время со времени входа клиента.
			Посещение = ПолучитьПосещение(СтруктурнаяЕдиница, Клиент, ДатаПрохода,, Ложь);
			Если Не Посещение = Неопределено Тогда
				// Определяем время общее время.
				ОбщееВремя = (ДатаПрохода - Посещение.ДатаУхода + Посещение.ВремяПосещения)/60;
				// Клиент может еще раз зайти.
				Если СтрокаЧленство.ВремяПосещенияНеБолее > ОбщееВремя Тогда
					Для Каждого СтрокаМ из МассивДоступа Цикл
						НоваяСтрока = ТаблицаДоступов.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМ);
					КонецЦикла;

					// остальные проверки не нужны
					Продолжить;

				КонецЕсли;                                                  				
			КонецЕсли;			
		КонецЕсли;

		// Проверка на ограничение по коли-ву посещений	
		// проработать, чтоб выходить бесконечно не могли
		Если РегистироватьПроход И Вход И СтрокаЧленство.ПосещенийНеЧаще > 0 и МассивДоступа.Количество() > 0 Тогда

			Если НеСоздаватьНовоеПосещение > 0 Тогда							
				Посещение = ПолучитьПосещение(СтруктурнаяЕдиница, Клиент, ДатаПрохода,, Ложь);				
				Если Не Посещение = Неопределено Тогда 					
					Если НЕ Посещение = Неопределено И Посещение.ПосещениеЗакрыто 
						И Посещение.ДатаУхода >= ДатаПрохода - (НеСоздаватьНовоеПосещение * 60) Тогда

						Для Каждого СтрокаМ из МассивДоступа Цикл
							НоваяСтрока = ТаблицаДоступов.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМ);
						КонецЦикла;					

						// остальные проверки не нужны
						Продолжить;

					КонецЕсли;							           
				КонецЕсли; 									
			КонецЕсли;		

			Если ПроверкаНаОграниченияПоПосещениям(СтрокаЧленство, ТекущаяДата, Клиент) Тогда
				Для Каждого СтрокаМ из МассивДоступа Цикл
					НоваяСтрока = ТаблицаДоступов.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМ);				
				КонецЦикла;			
			КонецЕсли;	

		Иначе
			Для Каждого СтрокаМ из МассивДоступа Цикл
				НоваяСтрока = ТаблицаДоступов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМ);
			КонецЦикла; 			
		КонецЕсли;   						
	КонецЦикла; 
	
	//++дв
	//Подменяем дату прохода текущего дня датой прохода вчерашнего дня если клиент не вышел до начала следующих суток.
	Попытка
		НеЗакрытоеВчерашнееПосещение = ПолучитьНеЗакрытоеВчерашнееПосещение(СтруктурнаяЕдиница, Клиент, ДатаПрохода, Карта, Истина);
		Если ЗначениеЗаполнено(НеЗакрытоеВчерашнееПосещение) Тогда
			ДатаПрохода = НеЗакрытоеВчерашнееПосещение.ДатаПрихода;
		КонецЕсли;
	Исключение
	КонецПопытки;
	//--дв

	// Если у клиента есть доступ по членствам, то дальше не определяем.
	Для Каждого СтрокаТЧ из ТаблицаДоступов Цикл
		Если ДатаПрохода >= СтрокаТЧ.ВремяНачало и ДатаПрохода <= СтрокаТЧ.ВремяКонца Тогда

			// Проверим на просрочки.
			Если СтрокаТЧ.Просрочка = Истина Тогда
				СтруктураВозврат.Доступ    = Ложь;
				СтруктураВозврат.Основание = СтрокаТЧ.ЧленствоПакетУслуг;
				СтруктураВозврат.Описание  = "просрочка платежа рассрочки";

			// Проверим на наличие мед. справки.
			ИначеЕсли ТребуетсяМедСправка И СтрокаТЧ.ТребуетсяМедСправка И НЕ МедСправкаДействительна Тогда
				СтруктураВозврат.Доступ    = Ложь;
				СтруктураВозврат.Основание = СтрокаТЧ.ЧленствоПакетУслуг;
				СтруктураВозврат.Описание  = "нет действующей мед. справки";			
			Иначе
				
				// ++ ЛАА 
				
				ЭтоДКК					= Ложь;
				ЭтоСопровождение		= Ложь;
				ЕстьОснованиеПрохода	= Ложь;
				
				Попытка
					
					Если СтрНайти(СтрокаТЧ.ЧленствоПакетУслуг.Номенклатура.Наименование, "ДКК") > 0 Тогда				
						ЭтоДКК = Истина;	
					ИначеЕсли СтрНайти(СтрокаТЧ.ЧленствоПакетУслуг.Номенклатура.Наименование, "Сопровождение") > 0 Тогда
						ЭтоСопровождение = Истина;
						ЕстьОснованиеПрохода = ПроверитьСопровождение(Клиент, Карта, ДатаПрохода, Вход, СтруктурнаяЕдиница, СтрокаТЧ);
					КонецЕсли;
					
				Исключение
					
					ЭтоДКК = Ложь; 
					ЭтоСопровождение = Ложь;
					PocketKey_Модуль.ОтправитьСообщение(ОписаниеОшибки());
					
				КонецПопытки;		
								
				Если ЭтоСопровождение Тогда;
					
					Если ЕстьОснованиеПрохода Тогда			
						
						СтруктураВозврат.Доступ		= Истина;
						СтруктураВозврат.Описание	= "(сопровождение)";
						СтруктураВозврат.Основание	= СтрокаТЧ.ЧленствоПакетУслуг;
						
						Возврат СтруктураВозврат;
						
					Иначе
						
						СтруктураВозврат.Доступ		= Ложь;
						СтруктураВозврат.Описание	= "нет основания (сопровождение)";
						СтруктураВозврат.Основание	= СтрокаТЧ.ЧленствоПакетУслуг;
						
					КонецЕсли;
					
				ИначеЕсли ЭтоДКК Тогда;
					
					СтруктураВозврат.Доступ		= Ложь;
					СтруктураВозврат.Описание	= "нет основания (ДКК)";
					СтруктураВозврат.Основание	= СтрокаТЧ.ЧленствоПакетУслуг;
					
				Иначе
					
					СтруктураВозврат.Доступ		= Истина;
					СтруктураВозврат.Описание	= "";
					СтруктураВозврат.Основание	= СтрокаТЧ.ЧленствоПакетУслуг;
					Возврат СтруктураВозврат;
					
				КонецЕсли;
				
				// -- ЛАА
 				
			КонецЕсли;						   
		КонецЕсли;		
	КонецЦикла; 	

	// Очищаем таблицу доступов.
	ТаблицаДоступов.Очистить();

	// 2. Запись на занятие.
	
	// ++ LZRV
	ВремяПереодеванияДо    = Константы.ВремяПереодеванияДоЗанятия.Получить() * 60;
	ВремяПереодеванияПосле = Константы.ВремяПереодеванияПослеЗанятия.Получить() * 60;
	// -- LZRV
	
	Если НачалоДня(ТекущаяДата - ВремяПереодеванияПосле) < НачалоДня(ТекущаяДата) Тогда
		ДатаСреза = ТекущаяДата;
	Иначе
		ДатаСреза = ТекущаяДата - ВремяПереодеванияПосле
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Клиент" , Клиент);
	Запрос.УстановитьПараметр("Дата"   , ДатаСреза);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);	
	Если Не МассивПомещений = Неопределено Тогда
		Запрос.УстановитьПараметр("МассивПомещений", МассивПомещений);
	КонецЕсли;

	Запрос.Текст = ПолучитьТекстЗапросаЗанятийПоПомещениям();		
	ТаблицаЗанятий = Запрос.Выполнить().Выгрузить();

	Для Каждого СтрокаТЧ из ТаблицаЗанятий Цикл 

		// Отсекаем временные брони.
		Если ЗначениеЗаполнено(СтрокаТЧ.ДатаБронирования) И Не ЗначениеЗаполнено(СтрокаТЧ.ОснованиеОплаты) Тогда
			Продолжить;
		КонецЕсли;

		НоваяСтрока = ТаблицаДоступов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
		НоваяСтрока.ВремяНачало = СтрокаТЧ.ВремяНачало - ВремяПереодеванияДо;
		НоваяСтрока.ВремяКонца  = СтрокаТЧ.ВремяКонца + ВремяПереодеванияПосле;
		
		//++Лазарев
			
			Если PocketKey_Модуль.PocketKey_УслугаЗанятияВСегментеДобавленияВремени(СтрокаТЧ.Услуга, 1) Тогда
				НоваяСтрока.ВремяНачало = СтрокаТЧ.ВремяНачало - (60*60); //60 мин 
				НоваяСтрока.ВремяКонца  = СтрокаТЧ.ВремяКонца + (2*60*60); //добавим 2 часа
			КонецЕсли;		
			
			Если PocketKey_Модуль.PocketKey_УслугаЗанятияВСегментеДобавленияВремени(СтрокаТЧ.Услуга, 2) Тогда
				НоваяСтрока.ВремяНачало = СтрокаТЧ.ВремяНачало - (30*60); //30 мин 
				НоваяСтрока.ВремяКонца  = СтрокаТЧ.ВремяКонца + (30*60); //30 мин
			КонецЕсли;
			
			//++ ЗМВ 06.05.2025
			Если PocketKey_Модуль.PocketKey_УслугаЗанятияВСегментеДобавленияВремени(СтрокаТЧ.Услуга, 3) Тогда
				НоваяСтрока.ВремяНачало = СтрокаТЧ.ВремяНачало - (60*60); //60 мин 
				НоваяСтрока.ВремяКонца  = СтрокаТЧ.ВремяКонца + (60*60); //60 мин
			КонецЕсли;
			//-- ЗМВ 06.05.2025	
			
		//--Лазарев
			
	КонецЦикла;       	

	// Сортируем таблицу по приоритету членств, пакетов и т.д.
	ТаблицаДоступов.Сортировать("Приоритет Возр");	

	Для Каждого СтрокаТЧ из ТаблицаДоступов Цикл
		Если ДатаПрохода >= СтрокаТЧ.ВремяНачало и ДатаПрохода <= СтрокаТЧ.ВремяКонца Тогда
			// Проверим на наличие мед. справки.
			Если ТребуетсяМедСправка И СтрокаТЧ.ТребуетсяМедСправка И НЕ МедСправкаДействительна Тогда
				СтруктураВозврат.Доступ    = Ложь;
				СтруктураВозврат.Основание = СтрокаТЧ.ЧленствоПакетУслуг;
				СтруктураВозврат.Описание  = "нет действующей мед. справки";
			Иначе			
				СтруктураВозврат.Доступ    = Истина;
				СтруктураВозврат.Основание = СтрокаТЧ.ЧленствоПакетУслуг;
				Возврат СтруктураВозврат;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	// Если у клиента нет оснований для прохода, то проверим есть ли у него членства/пакеты услуг, которые можно активировать.
	//Если АктивироватьЧПУ Тогда
	// Активируем без параметров ЧПУ

	Если РегистироватьПроход И Вход Тогда

		ДанныеЧПУ = ПолучитьЧленствоПакетУслугДляАктивациПриПроходе(Клиент, СтруктурнаяЕдиница, ДатаПрохода);		
		Если Не ДанныеЧПУ = Неопределено Тогда

			// Проверим на наличие мед. справки. Если у члентсва требуется наличие мед. справки,
			// а у клиента ее нет, нет смысла активировать это ЧПУ.
			Если ТребуетсяМедСправка И ДанныеЧПУ.ТребуетсяМедСправка И НЕ МедСправкаДействительна Тогда
				СтруктураВозврат.Доступ    = Ложь;
				СтруктураВозврат.Основание = ДанныеЧПУ.ЧленствоПакетУслуг;
				СтруктураВозврат.Описание  = "нет действующей мед. справки";
			Иначе					

				Попытка
					ОбъектЧПУ = ДанныеЧПУ.ЧленствоПакетУслуг.ПолучитьОбъект();
					ОбъектЧПУ.ДатаРучнойАктивации = ТекущаяДатаСеанса();
					ОбъектЧПУ.Записать(РежимЗаписиДокумента.Проведение);

					Возврат ПолучитьДоступ(Клиент, Карта, ДатаПрохода, Вход, СтруктурнаяЕдиница, МассивПомещений, АктивироватьЧПУ, НеСоздаватьНовоеПосещение, ТребуетсяМедСправка, РегистироватьПроход);

				Исключение				
					ЗаписьЖурналаРегистрации("СКУД", УровеньЖурналаРегистрации.Ошибка,,, "Ошибка активации " + ОписаниеОшибки());				
				КонецПопытки;
			КонецЕсли;

		КонецЕсли;		

	КонецЕсли;

	// СоДоступ, првоерим ЧПУ в дургих СЕ
	Если СоДоступКлубов.РазрешенСоДоступ(СтруктурнаяЕдиница) И ЭтоКлиентСоДоступ(Клиент) Тогда
		СтруктураДоступа = МенеджерОборудованияСКУД_КОРП.ПолучитьДоступВДругихКлубах(Карта.КодКарты, ДатаПрохода, СтруктурнаяЕдиница);
		Если СтруктураДоступа.Доступ Тогда
			ОснованиеСоДоступа = ПолучитьОснованиеСоДоступ(СтруктураДоступа.Основание);
			Если НЕ ОснованиеСоДоступа = Неопределено Тогда
				СтруктураВозврат.Доступ    = Истина;
				СтруктураВозврат.Основание = ОснованиеСоДоступа;
				СтруктураВозврат.Вставить("СоДоступСЕ", СтруктураДоступа.СтруктурнаяЕдиница);
				Возврат СтруктураВозврат;	
			КонецЕсли;			
		КонецЕсли;		
	КонецЕсли;
	
	#Область ЛАА_СистемаШтрафов_Добавлено
	
	Попытка
		
		Если НЕ Вход Тогда
			Если НЕ PocketKey_Исключения.PocketKey_ИсключитьИзПроверкиНаШтраф(Карта.ВладелецКарты) Тогда
				
				// Проверяем задержку и выставляем штраф
				PocketKey_ПродажиОплаты.ВыставитьШтрафКлиенту(Карта.ВладелецКарты, СтруктурнаяЕдиница);
				// Получаем не оплаченный штраф
				ДокументРеализация = PocketKey_ПродажиОплаты.ПолучитьНеОплаченныйШтраф(Карта.ВладелецКарты, СтруктурнаяЕдиница);		
				// При наличии документа реализации со штрафом попытаемся оплатить его
				Если ДокументРеализация <> Неопределено Тогда
					ДокументОплачен = PocketKey_ПродажиОплаты.ОплатаСЛицевогоСчета(ДокументРеализация);
					// И если оплата прошла то отправляем на кассовый сервер
					Если ДокументОплачен Тогда
						PocketKey_ПродажиОплаты.ОтправитьНаКассовыйСервер(ДокументРеализация);
					КонецЕсли;
				КонецЕсли;
				// Запретим выход если штраф не оплачен или есть другой долг
				СуммаДолга = PocketKey_ПродажиОплаты.ПолучитьСуммуДолга(Карта.ВладелецКарты, СтруктурнаяЕдиница);
				Если СуммаДолга > 0 Тогда
					СтруктураВозврат.Доступ		= Ложь;
					СтруктураВозврат.Описание	= "штраф";
				КонецЕсли;	
				
			КонецЕсли;
		КонецЕсли;
		
	Исключение
		ЗаписьЖурналаРегистрации("СКУД", УровеньЖурналаРегистрации.Ошибка,,, "Ошибка (штраф):" + ОписаниеОшибки());
	КонецПопытки;
	
	#КонецОбласти

	Возврат СтруктураВозврат;

КонецФункции

Функция PocketKey_ПолучитьТекстЗапросаЗанятийПоПомещениям_Старый()
	
	ТекстЗапроса =
	
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Занятия.ОснованиеОплаты = НЕОПРЕДЕЛЕНО
	|			ТОГДА Занятия.Ссылка
	|		ИНАЧЕ Занятия.ОснованиеОплаты
	|	КОНЕЦ КАК ЧленствоПакетУслуг,
	|	Занятия.Ссылка.Дата КАК ВремяНачало,
	|	Занятия.Ссылка.ДатаВремяОкончания КАК ВремяКонца,
	|	Занятия.Ссылка.Помещение КАК Помещение,
	|	ВЫБОР
	|		КОГДА НЕ Занятия.ОснованиеОплаты = НЕОПРЕДЕЛЕНО
	|				И Занятия.ОснованиеОплаты ССЫЛКА Документ.ЧленствоПакетУслуг
	|			ТОГДА Занятия.ОснованиеОплаты.Номенклатура.ТребНалМедСправки
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ТребуетсяМедСправка,
	|	Занятия.ДатаБронирования КАК ДатаБронирования,
	|	Занятия.ОснованиеОплаты КАК ОснованиеОплаты,
	|	4 КАК Приоритет,
	|	Занятия.ОснованиеОплаты.Номенклатура.ЧленствоПакетУслугОграничениеПоПомещениям КАК ОграничениеПоПомещениям,
	|	Занятия.ОснованиеОплаты.ДоступКПомещениям КАК ДоступКПомещениям,
	|	Занятия.Ссылка.Номенклатура КАК Услуга
	|ИЗ
	|	Документ.Занятие.СоставЗанятия КАК Занятия
	|ГДЕ
	|	Занятия.Ссылка.ДатаВремяОкончания > &Дата
	|	И (Занятия.Ссылка.СтатусЗанятия = ЗНАЧЕНИЕ(Перечисление.СтатусыЗанятия.Запланировано)
	|			ИЛИ Занятия.Ссылка.СтатусЗанятия = ЗНАЧЕНИЕ(Перечисление.СтатусыЗанятия.Проводится)
	|			ИЛИ Занятия.Ссылка.СтатусЗанятия = ЗНАЧЕНИЕ(Перечисление.СтатусыЗанятия.Проведено))
	|	И Занятия.Ссылка.Проведен
	|	И (НАЧАЛОПЕРИОДА(Занятия.Ссылка.ДатаВремяОкончания, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
	|			ИЛИ НАЧАЛОПЕРИОДА(Занятия.Ссылка.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ))
	|	И Занятия.Контрагент = &Клиент
	|	И Занятия.Ссылка.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И НЕ Занятия.СтатусПрибытия = 2"; 
	
	Возврат ТекстЗапроса;

КонецФункции

&Вместо("ПолучитьТекстЗапросаЗанятийПоПомещениям")
// Функция, возвращает текст запроса.
//
Функция PocketKey_ПолучитьТекстЗапросаЗанятийПоПомещениям()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЗанятиеСоставЗанятия.Ссылка КАК Занятие,
	|	ЗанятиеСоставЗанятия.Контрагент КАК Контрагент,
	|	ЗанятиеСоставЗанятия.ОснованиеОплаты КАК ОснованиеОплаты,
	|	ЗанятиеСоставЗанятия.ДатаБронирования КАК ДатаБронирования
	|ПОМЕСТИТЬ ТаблицаСоставаЗанятия
	|ИЗ
	|	Документ.Занятие.СоставЗанятия КАК ЗанятиеСоставЗанятия
	|ГДЕ
	|	ЗанятиеСоставЗанятия.Контрагент = &Клиент
	|	И НЕ ЗанятиеСоставЗанятия.СтатусПрибытия = 2
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЗаписьНаЗанятие.Занятие,
	|	ЗаписьНаЗанятие.Контрагент,
	|	ЗаписьНаЗанятие.ОснованиеОплаты,
	|	ЗаписьНаЗанятие.ДатаБронирования
	|ИЗ
	|	Документ.ЗаписьНаЗанятие КАК ЗаписьНаЗанятие
	|ГДЕ
	|	ЗаписьНаЗанятие.Проведен
	|	И ЗаписьНаЗанятие.Контрагент = &Клиент
	|	И НЕ ЗаписьНаЗанятие.СтатусПрибытия = 2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ТаблицаСоставаЗанятия.ОснованиеОплаты = НЕОПРЕДЕЛЕНО
	|			ТОГДА ТаблицаСоставаЗанятия.Занятие
	|		ИНАЧЕ ТаблицаСоставаЗанятия.ОснованиеОплаты
	|	КОНЕЦ КАК ЧленствоПакетУслуг,
	|	ДокументЗанятие.Дата КАК ВремяНачало,
	|	ДокументЗанятие.ДатаВремяОкончания КАК ВремяКонца,
	|	ДокументЗанятие.Помещение КАК Помещение,
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаСоставаЗанятия.ОснованиеОплаты = НЕОПРЕДЕЛЕНО
	|				И ТаблицаСоставаЗанятия.ОснованиеОплаты ССЫЛКА Документ.ЧленствоПакетУслуг
	|			ТОГДА ТаблицаСоставаЗанятия.ОснованиеОплаты.Номенклатура.ТребНалМедСправки
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ТребуетсяМедСправка,
	|	ТаблицаСоставаЗанятия.ДатаБронирования КАК ДатаБронирования,
	|	ТаблицаСоставаЗанятия.ОснованиеОплаты КАК ОснованиеОплаты,
	|	4 КАК Приоритет,
	|	ТаблицаСоставаЗанятия.ОснованиеОплаты.Номенклатура.ЧленствоПакетУслугОграничениеПоПомещениям КАК ОграничениеПоПомещениям,
	|	ТаблицаСоставаЗанятия.ОснованиеОплаты.ДоступКПомещениям.(
	|		Ссылка КАК Поле1,
	|		НомерСтроки КАК Поле2,
	|		Помещение КАК Поле3
	|	) КАК ДоступКПомещениям,
	
	// ++ ЛАА
	|	ДокументЗанятие.Ссылка.Номенклатура КАК Услуга
	// -- ЛАА 
	
	|ИЗ
	|	ТаблицаСоставаЗанятия КАК ТаблицаСоставаЗанятия
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Занятие КАК ДокументЗанятие
	|		ПО ТаблицаСоставаЗанятия.Занятие = ДокументЗанятие.Ссылка
	|ГДЕ
	|	ДокументЗанятие.ДатаВремяОкончания > &Дата
	|	И (ДокументЗанятие.СтатусЗанятия = ЗНАЧЕНИЕ(Перечисление.СтатусыЗанятия.Запланировано)
	|			ИЛИ ДокументЗанятие.СтатусЗанятия = ЗНАЧЕНИЕ(Перечисление.СтатусыЗанятия.Проводится)
	|			ИЛИ ДокументЗанятие.СтатусЗанятия = ЗНАЧЕНИЕ(Перечисление.СтатусыЗанятия.Проведено))
	|	И ДокументЗанятие.Проведен
	|	И (НАЧАЛОПЕРИОДА(ДокументЗанятие.ДатаВремяОкончания, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
	|			ИЛИ НАЧАЛОПЕРИОДА(ДокументЗанятие.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ))
	|	И ДокументЗанятие.СтруктурнаяЕдиница = &СтруктурнаяЕдиница"; 
	
	Возврат ТекстЗапроса;
	
КонецФункции


&Вместо("СоздатьПроезд")
Процедура PocketKey_СоздатьПроезд(СтруктурнаяЕдиница, Клиент, Дата, Основание, ЭтоВход, Карта, Ключ)
	
	//++ЛАА
	Возврат;
	//--ЛАА
	
	Если ЭтоВход = Истина Тогда
		Документы.Парковка.СоздатьДокументПарковки(СтруктурнаяЕдиница, Клиент, Основание, Карта, Ключ, Дата, Неопределено, Неопределено);
	Иначе
		Документы.Парковка.ЗаписатьВыездСПарковки(СтруктурнаяЕдиница, Клиент, Дата, Основание, Карта, Ключ);
	КонецЕсли;

КонецПроцедуры

&Вместо("ПолучитьДоступПарковка")
Функция PocketKey_ПолучитьДоступПарковка(Клиент, Карта, ДатаПрохода, Вход, СтруктурнаяЕдиница)
	
	СегментНоменклатур = Неопределено;
	
	//++
	ДопВремяПарковка = 20 * 60;
	//--
	
	СтруктураВозврат = Новый Структура("Доступ, Основание, Гость, Описание", Ложь, , Ложь, "");

	ТекущаяДата            = НачалоДня(ДатаПрохода);
	ТекущееВремя           = Дата(1,1,1,Час(ДатаПрохода),Минута(ДатаПрохода),00);
	ДеньНедели             = ДеньНедели(ТекущаяДата);
	ЭтоПраздничныйДень     = ОбщегоНазначения.ЭтоПраздничныйДень(ТекущаяДата);
	ЭтоРабочийДень 	   	   = ОбщегоНазначения.ЭтоРабочийДень(ТекущаяДата);
	ВремяПереодеванияДо    = Константы.ВремяПереодеванияДоЗанятия.Получить() * 60 + ДопВремяПарковка;
	ВремяПереодеванияПосле = Константы.ВремяПереодеванияПослеЗанятия.Получить() * 60;

	МассивВремениРаботы = ВремяРаботыСтруктурнойЕдиницы(СтруктурнаяЕдиница, ДеньНедели, ДатаПрохода, ЭтоПраздничныйДень);

	Если Не ЗначениеЗаполнено(МассивВремениРаботы) Тогда
		Возврат СтруктураВозврат;
	КонецЕсли;

	ТаблицаДоступов = СоздатьТаблицуДоступов();

	// 1. Членства и пакеты посещений
	ТаблицаЧленств = ПолучитьТаблицуЧленств(СтруктурнаяЕдиница, Клиент, ДатаПрохода);

	Для Каждого СтрокаЧленство из ТаблицаЧленств Цикл

		// Проверим на вхождение в сегмент
		Если ЗначениеЗаполнено(СегментНоменклатур) И НЕ РегистрыСведений.СоставСегментов.СегментСодержитОбъект(СегментНоменклатур, СтрокаЧленство.Номенклатура) Тогда
			Продолжить;			
		КонецЕсли;

		МассивДоступа = Новый Массив;

		// Проверка на просрочку по рассрочкам.
		Если ТипЗнч(СтрокаЧленство.ДокументПродажи) = Тип("ДокументСсылка.Реализация") И СтрокаЧленство.ОплачиваетсяВРассрочку = Истина
			И ПросрочкаОплатыПоРассрочке(СтрокаЧленство.ДокументПродажи, СтрокаЧленство.ШаблонРассрочки, СтрокаЧленство.СуммаПродажи) Тогда

			// Добавим это ЧПУ в таблицу доступа, чтобы вывести сообщение в журнал о причине отказа прохода.			
			НоваяСтрока = ТаблицаДоступов.Добавить();
			НоваяСтрока.ЧленствоПакетУслуг = СтрокаЧленство.ЧленствоПакетУслуг;
			НоваяСтрока.ВремяНачало        = ДатаПрохода;  // тут нам не важны реальные интервалы вермени доступа
			НоваяСтрока.ВремяКонца         = ДатаПрохода;
			НоваяСтрока.Просрочка          = Истина;

			// Дальнейшие проверки не выполняем, просрочена оплата ЧПУ.
			Продолжить;
		КонецЕсли;		

		// Если членство или пакет услуг ограничено посещениями.
		// При последнем посещение после входа остаток будет 0, но мы должны впускать и выпускать клиента по зонам.
		Если СтрокаЧленство.Остаток = 0 И Вход Тогда						
			Продолжить;		
		КонецЕсли;		

		Если СтрокаЧленство.ОграниченияПоВремениДействияИзменены ИЛИ СтрокаЧленство.ВремяДействия.Количество() > 0 Тогда
			ОграничениеПоВремениДействия = СтрокаЧленство.ОграничениеПоВремениДействия;
			ТаблицаВремяДействия 		 = СтрокаЧленство.ВремяДействия;
		Иначе
			ОграничениеПоВремениДействия = СтрокаЧленство.НоменклатураОграничениеПоВремениДействия;
			ТаблицаВремяДействия 		 = СтрокаЧленство.НоменклатураВремяДействия;
		КонецЕсли;

		Если ОграничениеПоВремениДействия = Перечисления.ТипыОграниченийЧленствПакетовУслуг.ВремяОграничено Тогда
			Для каждого СтрокаТЧ Из ТаблицаВремяДействия Цикл

				Если ПроверкаОграниченияПоДнямНедели(СтрокаТЧ.ДеньНедели, ТекущаяДата, ЭтоРабочийДень) Тогда

					// Если Время начало больше времени конца, значит время конца другой день.
					// 01.01.0001 09:00 и 01.01.0001 02:00 и надо перекинуть на другой день.
					ВремяПо = ?(СтрокаТЧ.ВремяС > СтрокаТЧ.ВремяПо, СтрокаТЧ.ВремяПо + 86400, СтрокаТЧ.ВремяПо);

					// Проверяем предыдущий день, в том случае если стуктурка работает после 24 часов.
					Если МассивВремениРаботы.Количество() > 1 Тогда
						ПредыдущийДеньРабочий = ОбщегоНазначения.ЭтоРабочийДень(ТекущаяДата - 1);
						Если ПроверкаОграниченияПоДнямНедели(СтрокаТЧ.ДеньНедели, ТекущаяДата - 1, ПредыдущийДеньРабочий) И День(ВремяПо) = 2 Тогда  

							// Если время окончания работы клуба меньше чем указано в членстве, проводим корректировку.
							Если МассивВремениРаботы[0].ОкончаниеРаботы > (Дата(1,1,1) + Час(СтрокаТЧ.ВремяПо) * 3600 + Минута(СтрокаТЧ.ВремяПо) * 60) Тогда
								ВремяКонца  = (ТекущаяДата + Час(СтрокаТЧ.ВремяПо) * 3600 + Минута(СтрокаТЧ.ВремяПо) * 60) + ВремяПереодеванияПосле; 			
							Иначе
								ВремяКонца  = (ТекущаяДата + Час(МассивВремениРаботы[0].ОкончаниеРаботы) * 3600 + Минута(МассивВремениРаботы[0].ОкончаниеРаботы) * 60) + ВремяПереодеванияПосле;
							КонецЕсли;

							МассивДоступа.Добавить(Новый Структура("ЧленствоПакетУслуг, ВремяНачало, ВремяКонца, Приоритет, ТребуетсяМедСправка",
							СтрокаЧленство.ЧленствоПакетУслуг, ТекущаяДата, ВремяКонца, СтрокаЧленство.Приоритет, СтрокаЧленство.ТребуетсяМедСправка));							
						КонецЕсли;	
					Иначе
						// Проверим на время окончания работы клуба.
						Если НЕ МассивВремениРаботы[0].ОкончаниеРаботы = Дата(1,1,1, 23,59,59)
							И МассивВремениРаботы[0].ОкончаниеРаботы < ВремяПо Тогда
							ВремяПо = МассивВремениРаботы[0].ОкончаниеРаботы;							
						КонецЕсли;
					КонецЕсли;
					
				    // Проверим на время начала работы клуба.
					Если МассивВремениРаботы[0].НачалоРаботы - ДопВремяПарковка > СтрокаТЧ.ВремяС Тогда
						ВремяС = МассивВремениРаботы[0].НачалоРаботы - ДопВремяПарковка;
						ВремяНачало = (ТекущаяДата + Час(ВремяС) * 3600 + Минута(ВремяС) * 60)
					Иначе
						ВремяНачало = (ТекущаяДата + Час(СтрокаТЧ.ВремяС) * 3600 + Минута(СтрокаТЧ.ВремяС) * 60) - ВремяПереодеванияДо - ДопВремяПарковка;
					КонецЕсли;

					ВремяНачало = (ТекущаяДата + Час(СтрокаТЧ.ВремяС) * 3600 + Минута(СтрокаТЧ.ВремяС) * 60) - ВремяПереодеванияДо - ДопВремяПарковка;
					Если День(ВремяПо) = 2 Тогда                                                                                           						 
						ВремяКонца = КонецДня(ТекущаяДата);
					Иначе
						ВремяКонца = (ТекущаяДата + Час(СтрокаТЧ.ВремяПо) * 3600 + Минута(СтрокаТЧ.ВремяПо) * 60) + ВремяПереодеванияПосле;						
					КонецЕсли;
					
					// ++ ЛАА (Добавлена проверка на время работы клуба)
					// Проверим на время начала работы клуба.
					ВремяНачалоРаботы = МассивВремениРаботы[0].НачалоРаботы - ДопВремяПарковка;
					Если Час(ВремяНачалоРаботы) > Час(ВремяНачало) Тогда
						ВремяНачало = (ТекущаяДата + Час(ВремяНачалоРаботы) * 3600 + Минута(ВремяНачалоРаботы) * 60);
					КонецЕсли; 
					// -- ЛАА (Добавлена проверка на время работы клуба)

					МассивДоступа.Добавить(Новый Структура("ЧленствоПакетУслуг, ВремяНачало, ВремяКонца, Приоритет, ТребуетсяМедСправка",
					СтрокаЧленство.ЧленствоПакетУслуг, ВремяНачало, ВремяКонца, СтрокаЧленство.Приоритет, СтрокаЧленство.ТребуетсяМедСправка));

				КонецЕсли; 
			КонецЦикла;
		Иначе 			
			Для Каждого СтрокаМ Из МассивВремениРаботы Цикл
				//+ Трегубов 07.07.2023 15/54
				ВремяНачалоЧленство = НачалоДня(ТекущаяДата) + Час(СтрокаМ.НачалоРаботы)    * 3600 + Минута(СтрокаМ.НачалоРаботы)    * 60 - ДопВремяПарковка; 
				//-
				//ВремяНачалоЧленство = НачалоДня(ТекущаяДата) + Час(СтрокаМ.НачалоРаботы)    * 3600 + Минута(СтрокаМ.НачалоРаботы)    * 60; 
				ВремяКонцаЧленство  = НачалоДня(ТекущаяДата) + Час(СтрокаМ.ОкончаниеРаботы) * 3600 + Минута(СтрокаМ.ОкончаниеРаботы) * 60;	
				МассивДоступа.Добавить(Новый Структура("ЧленствоПакетУслуг, ВремяНачало, ВремяКонца, Приоритет, ТребуетсяМедСправка",
				СтрокаЧленство.ЧленствоПакетУслуг, ВремяНачалоЧленство, ВремяКонцаЧленство, СтрокаЧленство.Приоритет, СтрокаЧленство.ТребуетсяМедСправка));			
			КонецЦикла;
		КонецЕсли;

		// Проверим на пакет посещений ограниченный временем
		Если ЗначениеЗаполнено(СтрокаЧленство.ВремяПосещенияНеБолее) И Вход Тогда
			// Определим время со времени входа клиента.
			Посещение = ПолучитьПосещение(СтруктурнаяЕдиница, Клиент, ДатаПрохода,, Ложь);
			Если Не Посещение = Неопределено Тогда
				// Определяем время общее время.
				ОбщееВремя = (ДатаПрохода - Посещение.ДатаУхода + Посещение.ВремяПосещения)/60;
				// Клиент может еще раз зайти.
				Если СтрокаЧленство.ВремяПосещенияНеБолее > ОбщееВремя Тогда
					Для Каждого СтрокаМ из МассивДоступа Цикл
						НоваяСтрока = ТаблицаДоступов.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМ);
					КонецЦикла;

					// остальные проверки не нужны
					Продолжить;

				КонецЕсли;                                                  				
			КонецЕсли;			
		КонецЕсли;

		// Проверка на ограничение по коли-ву посещений	
		// проработать, чтоб выходить бесконечно не могли
		Если Вход И СтрокаЧленство.ПосещенийНеЧаще > 0 и МассивДоступа.Количество() > 0 Тогда	

			Если ПроверкаНаОграниченияПоПосещениям(СтрокаЧленство, ТекущаяДата, Клиент) Тогда
				Для Каждого СтрокаМ из МассивДоступа Цикл
					НоваяСтрока = ТаблицаДоступов.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМ);				
				КонецЦикла;			
			КонецЕсли;
		Иначе
			Для Каждого СтрокаМ из МассивДоступа Цикл
				НоваяСтрока = ТаблицаДоступов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМ);
			КонецЦикла;  

		КонецЕсли;

	КонецЦикла; 
	
	//++дв
	//Подменяем дату прохода текущего дня датой прохода вчерашнего дня если клиент не вышел до начала следующих суток.
	Попытка
		НеЗакрытоеВчерашнееПосещение = ПолучитьНеЗакрытоеВчерашнееПосещение(СтруктурнаяЕдиница, Клиент, ДатаПрохода, Карта, Истина);
		Если ЗначениеЗаполнено(НеЗакрытоеВчерашнееПосещение) Тогда
			ДатаПрохода = НеЗакрытоеВчерашнееПосещение.ДатаПрихода;
		КонецЕсли;
	Исключение
	КонецПопытки;
	//--дв

	
	// Если у клиента есть доступ по членствам, то дальше не определяем.
	Для Каждого СтрокаТЧ из ТаблицаДоступов Цикл
		Если ДатаПрохода >= СтрокаТЧ.ВремяНачало и ДатаПрохода <= СтрокаТЧ.ВремяКонца Тогда

			// Проверим на просрочки.
			Если СтрокаТЧ.Просрочка = Истина Тогда
				СтруктураВозврат.Доступ    = Ложь;
				СтруктураВозврат.Основание = СтрокаТЧ.ЧленствоПакетУслуг;
				СтруктураВозврат.Описание  = "просрочка платежа рассрочки";					
			Иначе 			
				СтруктураВозврат.Доступ    = Истина;
				СтруктураВозврат.Основание = СтрокаТЧ.ЧленствоПакетУслуг;
				Возврат СтруктураВозврат;
			КонецЕсли;						   

		КонецЕсли;		
	КонецЦикла;
	
	// Очищаем таблицу доступов.
	ТаблицаДоступов.Очистить();

	//++ЛАА
	// 2. Запись на занятие.
	Если НачалоДня(ТекущаяДата - ВремяПереодеванияПосле) < НачалоДня(ТекущаяДата) Тогда
		ДатаСреза = ТекущаяДата;
	Иначе
		ДатаСреза = ТекущаяДата - ВремяПереодеванияПосле
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Клиент" , Клиент);
	Запрос.УстановитьПараметр("Дата"   , ДатаСреза);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);	
	
	Запрос.Текст = ПолучитьТекстЗапросаЗанятийПоПомещениям();		
	ТаблицаЗанятий = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаТЧ из ТаблицаЗанятий Цикл 
		
		// Отсекаем временные брони.
		Если ЗначениеЗаполнено(СтрокаТЧ.ДатаБронирования) И Не ЗначениеЗаполнено(СтрокаТЧ.ОснованиеОплаты) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаДоступов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
		НоваяСтрока.ВремяНачало = СтрокаТЧ.ВремяНачало - ВремяПереодеванияДо;
		НоваяСтрока.ВремяКонца  = СтрокаТЧ.ВремяКонца + ВремяПереодеванияПосле;
		
		
		Если PocketKey_Модуль.PocketKey_УслугаЗанятияВСегментеДобавленияВремени(СтрокаТЧ.Услуга, 1) Тогда
			НоваяСтрока.ВремяНачало = СтрокаТЧ.ВремяНачало - (60*60); //60 мин 
			НоваяСтрока.ВремяКонца  = СтрокаТЧ.ВремяКонца + (2*60*60); //добавим 2 часа 
		КонецЕсли;		
		
		Если PocketKey_Модуль.PocketKey_УслугаЗанятияВСегментеДобавленияВремени(СтрокаТЧ.Услуга, 2) Тогда
			НоваяСтрока.ВремяНачало = СтрокаТЧ.ВремяНачало - (30*60); //30 мин 
			НоваяСтрока.ВремяКонца  = СтрокаТЧ.ВремяКонца + (30*60); //30 мин
		КонецЕсли;	
		
	КонецЦикла;
	
	// Сортируем таблицу по приоритету членств, пакетов и т.д.
	ТаблицаДоступов.Сортировать("Приоритет Возр");	
	
	Для Каждого СтрокаТЧ из ТаблицаДоступов Цикл
		Если ДатаПрохода >= СтрокаТЧ.ВремяНачало и ДатаПрохода <= СтрокаТЧ.ВремяКонца Тогда		
			СтруктураВозврат.Доступ    = Истина;
			СтруктураВозврат.Основание = СтрокаТЧ.ЧленствоПакетУслуг;
			Возврат СтруктураВозврат;
		КонецЕсли;
	КонецЦикла;
	
	//--ЛАА

	Если СоДоступКлубов.РазрешенСоДоступ(СтруктурнаяЕдиница) И ЭтоКлиентСоДоступ(Клиент) Тогда
		СтруктураДоступа = МенеджерОборудованияСКУД_КОРП.ПолучитьДоступВДругихКлубах(Карта.КодКарты, ДатаПрохода);
		Если СтруктураДоступа.Доступ Тогда
			ОснованиеСоДоступа = ПолучитьОснованиеСоДоступ(СтруктураДоступа.Основание);
			Если НЕ ОснованиеСоДоступа = Неопределено Тогда
				СтруктураВозврат.Доступ    = Истина;
				СтруктураВозврат.Основание = ОснованиеСоДоступа;
				СтруктураВозврат.Вставить("СоДоступСЕ", СтруктураДоступа.СтруктурнаяЕдиница);
				Возврат СтруктураВозврат;	
			КонецЕсли;			
		КонецЕсли;		
	КонецЕсли;	

	Возврат СтруктураВозврат;

КонецФункции

Функция ПроверитьСопровождение(Клиент, Карта, ДатаПрохода, Вход, СтруктурнаяЕдиница, СтрокаТЧ) Экспорт
	
	ЕстьОснованиеДляПрохода = Ложь;
	
	Лог = "Сопровождение" + Символы.ПС;;
	Лог = Лог + "СТАРТ" + Символы.ПС;
	Лог = Лог + СтрокаТЧ.ЧленствоПакетУслуг.Контрагент + Символы.ПС;
	
	МассивСопровождаемых = PocketKey_Сопровождение.НайтиСопровождаемых(СтрокаТЧ.ЧленствоПакетУслуг.Контрагент.Ссылка);
	Для Каждого Сопровождаемый Из МассивСопровождаемых Цикл	
		Лог = Лог + Сопровождаемый + Символы.ПС;	
		МассивЧленствПакетовУслугСопровождаемого = PocketKey_Сопровождение.НайтиЧленстваСопровождаемых(Сопровождаемый);
		Для Каждого ЧПУ Из МассивЧленствПакетовУслугСопровождаемого Цикл
			
			PocketKey_Модуль.ОтправитьСообщение(Строка(ЧПУ));
			
			Если ЧПУ.ТипЧленстваПакетаУслуг = Перечисления.ТипыНоменклатуры.АбонементЧленство Тогда
				ЕстьОснованиеДляПрохода = PocketKey_Сопровождение.ПроверитьЧленствоНаВозможностьПрохода(ЧПУ, Вход);
				Лог = Лог + "Есть членство: " + ЧПУ + Символы.ПС;
				
				Если ЕстьОснованиеДляПрохода Тогда
					Возврат Истина;
				КонецЕсли;
			
			ИначеЕсли ЧПУ.ТипЧленстваПакетаУслуг = Перечисления.ТипыНоменклатуры.АбонементПакетУслуг Тогда	
				ЕстьОснованиеДляПрохода = PocketKey_Сопровождение.ПроверитьПакетУслугНаВозможностьПрохода(ЧПУ, Вход);
				Лог = Лог + "Есть пакет услуг: " + ЧПУ + Символы.ПС;
				
				Если ЕстьОснованиеДляПрохода Тогда
					Возврат Истина;
				КонецЕсли;

			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	
	// ++ ЗАНЯТИЕ
	Для Каждого Сопровождаемый Из МассивСопровождаемых Цикл
		Если НЕ ЕстьОснованиеДляПрохода Тогда
			
			ЕстьОснованиеДляПрохода = PocketKey_Сопровождение.НайтиЗаписьНаЗанятие(Сопровождаемый, Карта, ДатаПрохода, Вход, СтруктурнаяЕдиница, СтрокаТЧ);
			
			Если ЕстьОснованиеДляПрохода Тогда
				Возврат Истина;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	// -- ЗАНЯТИЕ
	
	Лог = Лог + "КОНЕЦ";				
	
	PocketKey_Модуль.ОтправитьСообщение(Лог);
	
	// КОНЕЦ
	
	Возврат ЕстьОснованиеДляПрохода;
	
КонецФункции

Функция ПолучитьНеЗакрытоеВчерашнееПосещение(СтруктурнаяЕдиница, Контрагент, Дата, Ключ = Неопределено, Открытое = Ложь)
	
	// Для ключей надо брать непроведенные и проведенные посещения.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата"              , ?(Дата = Неопределено, ТекущаяДатаСеанса(), Дата));
	Запрос.УстановитьПараметр("ПредыдущийДень"    , ?(Дата = Неопределено, НачалоДня(ТекущаяДатаСеанса()) - 1, НачалоДня(Дата) - 1));
	Запрос.УстановитьПараметр("Контрагент"        , Контрагент);
	Запрос.УстановитьПараметр("Ключ"              , Ключ);
	Запрос.УстановитьПараметр("Открытое"          , Открытое);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Запрос.Текст =                   
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Посещения.Ссылка КАК Ссылка,
	|	Посещения.Дата КАК Период,
	|	НАЧАЛОПЕРИОДА(Посещения.ДатаПрихода, МИНУТА) КАК ДатаПрихода,
	|	НАЧАЛОПЕРИОДА(Посещения.ДатаУхода, МИНУТА) КАК ДатаУхода,
	|	Посещения.Ключ КАК Ключ,
	|	Посещения.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	Посещения.Основание КАК Основание,
	|	Посещения.ПосещениеЗакрыто КАК ПосещениеЗакрыто,
	|	ЕСТЬNULL(Посещения.Основание.ВремяПосещенияНеБолее, 0) КАК ВремяПосещенияНеБолее,
	|	Посещения.ПризнакГость КАК ПризнакГость,
	|	Посещения.ВремяПосещения КАК ВремяПосещения
	|ИЗ
	|	Документ.Посещение КАК Посещения
	|ГДЕ
	|	Посещения.Дата <= &Дата
	|	И Посещения.Контрагент = &Контрагент
	//|	И &Ключ
	|	И НЕ Посещения.ПометкаУдаления
	//|	И (НАЧАЛОПЕРИОДА(Посещения.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
	//|			ИЛИ НАЧАЛОПЕРИОДА(Посещения.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ПредыдущийДень, ДЕНЬ))
	|	И НАЧАЛОПЕРИОДА(Посещения.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ПредыдущийДень, ДЕНЬ)
	|	И &Открытое
	|	И Посещения.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	
	//Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Ключ"    , ?(Ключ = Неопределено, "ИСТИНА", "Посещения.Ключ = &Ключ"));
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &Открытое", ?(Открытое, "И НЕ Посещения.ПосещениеЗакрыто", ""));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Структура = Новый Структура("Ссылка, Период, ДатаПрихода, ДатаУхода, Ключ, СтруктурнаяЕдиница, Основание, ПосещениеЗакрыто, ВремяПосещенияНеБолее, ПризнакГость, ВремяПосещения");		
		ЗаполнитьЗначенияСвойств(Структура, Выборка);
		Возврат Структура;
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции
